test/dummy/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @error = true
    id_array = params[:id_images].split(",")

    respond_to do |format|
      if @user.save
        id_array.map { |image_name|
          path = params["image_temporal_#{image_name}"]
          if !(path.to_s == "") && File.exist?(path.to_s)
            img = Crimagify::ImageFunctions::save_new_image(path.to_s,
                                               params["#{image_name}_crop_x"],
                                               params["#{image_name}_crop_y"],
                                               params["#{image_name}_crop_w"],
                                               params["#{image_name}_crop_h"],
                                               params[:parent],
                                               @user.id,
                                               image_name,
                                               false)
---
INSERT INTO "users" ("created_at", "email", "lastname", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 23 Apr 2013 21:32:33 UTC +00:00], ["email", "trejocola@gmail.com"], ["lastname", "jose"], ["name", "juan"], ["updated_at", Tue, 23 Apr 2013 21:32:33 UTC +00:00]]
INSERT INTO "crimagify_images" ("created_at", "image", "image_name", "image_temporal", "parent_id", "parent_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
    id_array = params[:id_images].split(",")

    id_array.map { |image_name|
      path = params["image_temporal_#{image_name}"]
      if !(path.to_s == "") && File.exist?(path.to_s)
        image = @user.crimagify_images.where("image_name=?",image_name)
        if !(image == [])
          image.map { |img|
            img.update_attributes(:image => File.open(path.to_s),
                                  :crop_x => params["#{image_name}_crop_x"],
                                  :crop_y => params["#{image_name}_crop_y"],
                                  :crop_w => params["#{image_name}_crop_w"],
                                  :crop_h => params["#{image_name}_crop_h"])
            img.crop_avatar_real
          }
        else
          img = Crimagify::ImageFunctions::save_new_image(path.to_s,
                                               params["#{image_name}_crop_x"],
                                               params["#{image_name}_crop_y"],
                                               params["#{image_name}_crop_w"],
                                               params["#{image_name}_crop_h"],
                                               params[:parent],
                                               @user.id,
                                               image_name,
                                               false)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "crimagify_images".* FROM "crimagify_images" WHERE "crimagify_images"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "crimagify_images" SET "image" = '2013-04-23-User-imgA-2.png', "updated_at" = '2013-04-23 22:08:32.915550' WHERE "crimagify_images"."id" = 2