test/dummy/app/views/users/_form.html.erb

<%= form_for(@user, :html => {:class => "nested_crimagify_images", :data => {parentobject: @user.class.name.underscore, parent: @user.products.first.class.name.underscore.pluralize} }) do |f| %>
---
SELECT "crimagify_images".* FROM "crimagify_images" WHERE (image_name='imgA' and parent_type='--- !ruby/class ''User''